In [34]:
import pandas as pd
import numpy as np

In [5]:
groceries = pd.Series(data = [30,6,'Yes', 'No'], index = ['eggs', 'apples', 'milk', 'bread'])
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [7]:
groceries.shape

(4,)

In [8]:
groceries.ndim

1

In [9]:
groceries.size

4

In [10]:
groceries.index

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [11]:
groceries.values

array([30, 6, 'Yes', 'No'], dtype=object)

In [12]:
'banana'in groceries

False

In [13]:
'eggs' in groceries

True

In [14]:
'Yes' in groceries

False

In [16]:
groceries[['milk', 'eggs']]

milk    Yes
eggs     30
dtype: object

In [17]:
groceries[0]

30

In [18]:
groceries[[0,1]]

eggs      30
apples     6
dtype: object

In [19]:
groceries.loc[['eggs', 'apples']]

eggs      30
apples     6
dtype: object

In [20]:
groceries.iloc[[2,3]]

milk     Yes
bread     No
dtype: object

In [21]:
groceries['eggs']

30

In [22]:
groceries['eggs'] = 'hola'
groceries

eggs      hola
apples       6
milk       Yes
bread       No
dtype: object

In [23]:
groceries.drop('apples')

eggs     hola
milk      Yes
bread      No
dtype: object

In [24]:
groceries

eggs      hola
apples       6
milk       Yes
bread       No
dtype: object

In [25]:
groceries.drop('apples', inplace = True)

In [27]:
groceries

eggs     hola
milk      Yes
bread      No
dtype: object

In [28]:
fruits = pd.Series([10,6,3], index = ['apples', 'oranges', 'bananas'])
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [29]:
fruits +2

apples     12
oranges     8
bananas     5
dtype: int64

In [30]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [31]:
fruits * 3

apples     30
oranges    18
bananas     9
dtype: int64

In [32]:
fruits / 5

apples     2.0
oranges    1.2
bananas    0.6
dtype: float64

In [33]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [35]:
np.sqrt(fruits)

apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [36]:
np.exp(fruits)

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [37]:
np.power(fruits, 2)

apples     100
oranges     36
bananas      9
dtype: int64

In [39]:
fruits.loc['bananas']+2

5

In [40]:
fruits.iloc[0]-4

6

In [41]:
fruits.loc[['apples', 'oranges']]+3

apples     13
oranges     9
dtype: int64

In [42]:
groceries

eggs     hola
milk      Yes
bread      No
dtype: object

In [43]:
groceries*2

eggs     holahola
milk       YesYes
bread        NoNo
dtype: object

In [48]:
import pandas as pd

# DO NOT CHANGE THE VARIABLE NAMES

# Given a list representing a few planets
planets = ['Earth', 'Saturn', 'Venus', 'Mars', 'Jupiter']

# Given another list representing the distance of each of these planets from the Sun
# The distance from the Sun is in units of 10^6 km
distance_from_sun = [149.6, 1433.5, 108.2, 227.9, 778.6]


# TO DO: Create a Pandas Series "dist_planets" using the lists above, representing the distance of the planet from the Sun.
# Use the `distance_from_sun` as your data, and `planets` as your index.
dist_planets = pd.Series(data = distance_from_sun, index = planets)


# TO DO: Calculate the time (minutes) it takes light from the Sun to reach each planet. 
# You can do this by dividing each planet's distance from the Sun by the speed of light.
# Use the speed of light, c = 18, since light travels 18 x 10^6 km/minute.
time_light = dist_planets / 18


# TO DO: Use Boolean indexing to select only those planets for which sunlight takes less
# than 40 minutes to reach them.
# We'll check your work by printing out these close planets.
close_planets = time_light[time_light<40]
close_planets

Earth     8.311111
Venus     6.011111
Mars     12.661111
dtype: float64

In [61]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [50]:
items = {'Bob' : pd.Series(data = [245, 25, 55]),
         'Alice' : pd.Series(data = [40, 110, 500, 45])}
df = pd.DataFrame(items)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [54]:
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [55]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [56]:
shopping_carts.size

10

In [57]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [58]:
shopping_carts.shape

(5, 2)

In [60]:
bob_shopping_carts = pd.DataFrame(items, columns = ['Alice'])
bob_shopping_carts

   Alice
0     40
1    110
2    500
3     45

In [65]:
books_shopping_carts = pd.DataFrame(items, index = ['hola', 'book'])
books_shopping_carts

      Bob  Alice
hola  NaN    NaN
book  NaN   40.0

In [66]:
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [67]:
df['dragon'] = df['Alice'][1:3]
df

     Bob  Alice  dragon
0  245.0     40     NaN
1   25.0    110   110.0
2   55.0    500   500.0
3    NaN     45     NaN

In [68]:
df.pop('dragon')
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [69]:
df.insert(0, "dragon", [1,2,3,4])
df

   dragon    Bob  Alice
0       1  245.0     40
1       2   25.0    110
2       3   55.0    500
3       4    NaN     45

In [71]:
df.drop(['dragon'], axis = 1)

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [73]:
df.drop([0,3], axis = 0)

   dragon   Bob  Alice
1       2  25.0    110
2       3  55.0    500

In [77]:
df = df.rename(columns = {'dragon': 'kitty'})
df

   kitty    Bob  Alice
0      1  245.0     40
1      2   25.0    110
2      3   55.0    500
3      4    NaN     45

In [78]:
df = df.rename(index = {0:'hola'})
df

      kitty    Bob  Alice
hola      1  245.0     40
1         2   25.0    110
2         3   55.0    500
3         4    NaN     45

In [79]:
df = df.set_index('Bob')
df

       kitty  Alice
Bob
245.0      1     40
25.0       2    110
55.0       3    500
NaN        4     45

In [80]:
books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])
dat = {'Author':authors, 'Book Title':books, 'User 1':user_1, 'User 2':user_2, 'User 3':user_3}
book_rating = pd.DataFrame(dat)
book_rating

                Author           Book Title  User 1  User 2  User 3
0      Charles Dickens   Great Expectations     3.2     5.0     2.0
1       John Steinbeck      Of Mice and Men     NaN     1.3     2.3
2  William Shakespeare     Romeo and Juliet     2.5     4.0     NaN
3          H. G. Wells     The Time Machine     NaN     3.8     4.0
4        Lewis Carroll  Alice in Wonderland     NaN     NaN     NaN

In [84]:
book_rating.fillna(book_rating.mean(), inplace = True)
book_rating

                Author           Book Title  User 1  User 2    User 3
0      Charles Dickens   Great Expectations    3.20   5.000  2.000000
1       John Steinbeck      Of Mice and Men    2.85   1.300  2.300000
2  William Shakespeare     Romeo and Juliet    2.50   4.000  2.766667
3          H. G. Wells     The Time Machine    2.85   3.800  4.000000
4        Lewis Carroll  Alice in Wonderland    2.85   3.525  2.766667

In [83]:
book_rating.mean()

User 1    2.850000
User 2    3.525000
User 3    2.766667
dtype: float64